////////////////////////////////////////////////////////////////////////////////////////////
// (1)Написать программу, которая заменяет все четные числа в целочисленном статическом массиве на 0. (массив из 10 элементов)

#include <iostream>


using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int arr[10];

	cout << "Введите 10 значений в массив" << endl;
	for (int i(0); i < 10; i++)
	{
		cin >> arr[i];
	}

	for (int i(0); i < 10; i++)
	{
		cout << arr[i] << " ";
	}

	cout << "замена четных чисел в целочисленном статическом массиве на 0" << endl;

	for (int i(0); i < 10; i++)
	{
		if (arr[i] % 2 == 0)
		{
			arr[i] = 0;
		}
	}

	for (int i(0); i < 10; i++)
	{
		cout << arr[i] << " ";
	}
	system("pause");
}
///////////////////////////////////////////////////////////////////////////////////////////
/*(2)Ввод символа с клавиатуры(с проверкой что это именно символ), ввод строки с клавиатуры(с проверкой что это именно строка).
Вывод в консоль номера, который символ занимает в строке, если он там есть. Если нет — вывод сообщения об отсутствии символа.*/

#include <iostream>
#include <string>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	string l;
	string str;

	cout << "Введите символ" << endl;
	do
	{
		getline(cin, str);
		if (str.length() > 1)
		{
			cout << "Введите ещё раз" << endl;
		}
	} while (str.length() > 1);
	cout << "Введён символ" << endl;

	do
	{
		getline(cin, str);
		if (str.length() <= 1)
		{
			cout << "Введите ещё раз" << endl;
		}
	} while (str.length() <= 1);
	cout << "Введена строка" << endl;

	char z;
	for (int i(0); i < str.length(); i++)
	{

		z = str[i];
		if (z != ' ')
		{
			cout << z << " has ASCII code " << static_cast<int>(z) << endl;
		}
		else
		{
			cout << "На этом месте нет символа" << endl;
		}
	}
	system("pause");
}
/////////////////////////////////////////////////////////////////////////////////////////////////////
/*(3)Расчет определителя матрицы, матрица размером 3 на 3 Ввод чисел построчно. Числа только целые.*/

#include <iostream>
#include <string>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	const int arr_shape = 3;
	int arr[arr_shape][arr_shape];

	cout << "Введите значения матрицы" << endl;
	for (int i(0); i < 3; i++)
	{
		for (int j(0); j < 3; j++)
		{
			cin >> arr[i][j];
		}
	}

	for (int i(0); i < 3; i++)
	{
		for (int j(0); j < 3; j++)
		{
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}

	cout << "Определитель матрицы" << endl;

	double A = 0;

	A = (arr[0][0] * arr[1][1] * arr[2][2]) + (arr[2][1] * arr[0][1] * arr[1][2]) + (arr[1][0] * arr[2][1] * arr[0][2]) - (arr[2][0] * arr[1][1] * arr[0][2]) - (arr[0][0] * arr[2][1] * arr[1][2]) - (arr[0][1] * arr[0][1] * arr[2][2]);

	cout << A << endl;

	system("pause");
}

/////////////////////////////////////////////////////////////////////////////////////////////////////